// Написати розв’язок нижче описаного завдання за допомогою arrow function:
// Створити функцію яка прийматиме одне числове значення.
// Це значення в функції означатиме кількіть елементів послідовності Фібаначі.
// Обрахуйте цю послідовність і виведіть виведіть всі її елементи в консоль.

// let f = (count) =>{
//       let a=1;
//       let b=1;
//       console.log(a);
//       console.log(b);
//       for(let i=3; i<=count;i++){
//             let c = a+b;
//             a=b;
//             b=c;
//             console.log(b);
//       }
// }
// f(5);

// Написати розв’язок нижче описаного завдання за допомогою function expression:
// Створіть функцію, яка обраховує суму чисел геометричної прогресії, в якій першим числом є 1. 
// Функція приймає два аргументи: кількість чисел прогресії і її знаменник . Наприклад, в прогресії типу 1,2,4,8,16 кількість чисел - 5, а знаменник – 2 (тому що кожне наступне число прогресії домножується на 2). Результат, який має повернути функція для даної прогресії 31.
// Функцію  потрібно написати двома способами:
// З використанням циклу
// З використанням формули знаходження суми геометричної прогресії:
// Sn=b1*1-qn1-q,
// де b1 – перший елемент прогресії (в даному завданні це 1),
// q – знаменник,
// n – кількість елементів прогресії

// let f = function(q,n){
//       let qn = 1;
//       for(let i=0; i<n; i++){
//             qn *= q;
//       }
//       console.log(qn);
//       let b1=1;
//       let s = (b1*(qn-1))/(q-1);
//       console.log(s);
// }
// f(2,3);
 
// Написати розв’язок нижче описаного завдання за допомогою function expression or arrow:
// Створіть функцію, в яку передається 2 параметри, які користувач вводить через вікно prompt(). 
// Потрібно щоб функція виводила діапазон тільки простих чисел console.log(), між тими які ввів користувач.

let f = function(n1,n2){
      if(n1==n2){
            console.log('null');
      }
      else if(n1<n2){
            for(let i=n1; i<=n2; i++){
                  if(i==3 || i ==5 || i==7){
                        console.log(i);
                  }
                  else if(i % 2!=0 && i % 3!=0 && i % 5!=0 && i % 7!=0){
                        console.log(i);
                  }          
            }
      }
      else if(n2<n1){
            for(let i=n2; i<=n1; i++){
                  if(i==3 || i ==5 || i==7){
                        console.log(i);
                  }
                  else if(i % 2!=0 && i % 3!=0 && i % 5!=0 && i % 7!=0){
                        console.log(i);
                  }          
            }
      }
}
let a =prompt('Input number one');
let b =prompt('Input number two');
f(a,b);